<a href="https://colab.research.google.com/github/IngErnestoAlvarez/terremoto_research/blob/main/Edificios_sin_destruccion.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [68]:
# importacion general de librerias y de visualizacion (matplotlib y seaborn)
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from matplotlib.ticker import (MultipleLocator,
                               FormatStrFormatter,
                               AutoMinorLocator)

%matplotlib inline

# haciendo los graficos un poco mas bonitos en matplotlib
plt.style.use('default') 
#plt.rcParams['figure.figsize'] = (20, 10)

sns.set(style="whitegrid") # seteando tipo de grid en seaborn

# suprimimos la notacion cientifica en los outputs
pd.options.display.float_format = '{:20,.2f}'.format 

import warnings
warnings.filterwarnings('ignore')

In [69]:
labels = pd.read_csv("train_labels.csv", dtype={'damage_grade': 'category'}, usecols=['building_id'])
labels.dropna(inplace=True)
labels.info()
labels.head(10)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234474 entries, 0 to 234473
Data columns (total 1 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   building_id  234474 non-null  int64
dtypes: int64(1)
memory usage: 3.6 MB

   building_id
0       802906
1        28830
2        94947
3       590882
4       201944
5       333020
6       728451
7       475515
8       441126
9       989500

In [70]:
values = pd.read_csv("train_values.csv", usecols=['building_id'])
values.dropna(inplace=True)
values.info()
values.head(10)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 260601 entries, 0 to 260600
Data columns (total 1 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   building_id  260601 non-null  int64
dtypes: int64(1)
memory usage: 4.0 MB

   building_id
0       802906
1        28830
2        94947
3       590882
4       201944
5       333020
6       728451
7       475515
8       441126
9       989500

In [71]:
labels.shape

(234474, 1)

In [72]:
values.shape

(260601, 1)

In [73]:
labels_id = labels.loc[:, ["building_id"]]
labels_id["in_labels"] = 1
labels_id

        building_id  in_labels
0            802906          1
1             28830          1
2             94947          1
3            590882          1
4            201944          1
...             ...        ...
234469       511489          1
234470       349671          1
234471       826545          1
234472       120874          1
234473            2          1

[234474 rows x 2 columns]

In [74]:
values_id = values.loc[:, ["building_id"]]
values_id["in_values"] = 1
values_id

        building_id  in_values
0            802906          1
1             28830          1
2             94947          1
3            590882          1
4            201944          1
...             ...        ...
260596       688636          1
260597       669485          1
260598       602512          1
260599       151409          1
260600       747594          1

[260601 rows x 2 columns]

In [76]:
values_and_labels_id = labels_id.merge(values_id, how='outer')
values_and_labels_id.loc[values_and_labels_id.in_labels.isnull() | values_and_labels_id.in_values.isnull(), :]

        building_id            in_labels            in_values
234473            2                 1.00                  nan
234474       234438                  nan                 1.00
234475       281964                  nan                 1.00
234476       998689                  nan                 1.00
234477       985831                  nan                 1.00
...             ...                  ...                  ...
260597       688636                  nan                 1.00
260598       669485                  nan                 1.00
260599       602512                  nan                 1.00
260600       151409                  nan                 1.00
260601       747594                  nan                 1.00

[26129 rows x 3 columns]